{
  "sodium.option_impact.low": "Низкий",
  "sodium.option_impact.medium": "Средний",
  "sodium.option_impact.high": "Высокий",
  "sodium.option_impact.extreme": "Экстремальный",
  "sodium.option_impact.varies": "Меняющийся",
  "sodium.options.pages.quality": "Качество",
  "sodium.options.pages.performance": "Представление",
  "sodium.options.pages.advanced": "Передовой",
  "sodium.options.view_distance.tooltip": "Расстояние рендеринга определяет, как далеко будет отображаться местность. Более короткие расстояния означают, что будет отображаться меньший объем местности, что повышает частоту кадров.",
  "sodium.options.simulation_distance.tooltip": "Расстояние моделирования определяет, насколько удаленные объекты будут загружены и помечены галочками. Более короткие расстояния могут снизить нагрузку на внутренний сервер и повысить частоту кадров.",
  "sodium.options.brightness.tooltip": "Управляет яркостью (гаммой) изображения в игре.",
  "sodium.options.gui_scale.tooltip": "Устанавливает максимальный масштабный коэффициент, который будет использоваться для пользовательского интерфейса. Если используется значение 'автоматически', то всегда будет использоваться наибольший масштабный коэффициент.",
  "sodium.options.fullscreen.tooltip": "Если эта функция включена, игра будет отображаться в полноэкранном режиме (если поддерживается).",
  "sodium.options.v_sync.tooltip": "Если этот параметр включен, частота смены кадров в игре будет синхронизирована с частотой обновления экрана монитора, что в целом обеспечит более плавное воспроизведение за счет снижения общей задержки ввода. Этот параметр может снизить производительность, если ваша система работает слишком медленно.",
  "sodium.options.fps_limit.tooltip": "Ограничивает максимальное количество кадров в секунду. Это может помочь снизить расход заряда батареи и общую нагрузку на систему при многозадачной работе. Если включена функция VSync, эта опция будет игнорироваться, если только она не будет ниже частоты обновления вашего дисплея.",
  "sodium.options.view_bobbing.tooltip": "Если эта функция включена, экран игрока будет раскачиваться при перемещении. Игроки, которых укачивает во время игры, могут воспользоваться отключением этой функции.",
  "sodium.options.attack_indicator.tooltip": "Управляет отображением индикатора атаки на экране.",
  "sodium.options.autosave_indicator.tooltip": "Если этот параметр включен, то при сохранении мира на диске будет отображаться индикатор.",
  "sodium.options.graphics_quality.tooltip": "Качество графики по умолчанию определяет некоторые устаревшие параметры и необходимо для совместимости с модами. Если для приведенных ниже параметров оставить значение \"Default\", они будут использовать этот параметр.",
  "sodium.options.clouds_quality.tooltip": "Управляет наличием визуализированных облаков на небе.",
  "sodium.options.weather_quality.tooltip": "Контролирует качество эффектов дождя и снега.",
  "sodium.options.leaves_quality.name": "Листва",
  "sodium.options.leaves_quality.tooltip": "Контролирует качество листьев.",
  "sodium.options.particle_quality.tooltip": "Контролирует максимальное количество частиц, которые могут присутствовать на экране в любой момент времени.",
  "sodium.options.smooth_lighting.tooltip": "Определяет, будут ли блоки равномерно подсвечиваться и затеняться. Это немного увеличивает время, необходимое для восстановления фрагмента, но не влияет на частоту кадров.",
  "sodium.options.biome_blend.value": "%s блок (а)",
  "sodium.options.biome_blend.tooltip": "Определяет диапазон биомов, которые будут выбраны для раскрашивания блоков. Более высокие значения значительно увеличивают время, необходимое для создания блоков, что снижает качество.",
  "sodium.options.entity_distance.tooltip": "Определяет, на каком расстоянии от игрока могут отображаться объекты. Более высокие значения увеличивают расстояние рендеринга за счет частоты кадров.",
  "sodium.options.entity_shadows.tooltip": "Если эта функция включена, под мобами и другими объектами будут отображаться базовые тени.",
  "sodium.options.vignette.name": "Виньетка",
  "sodium.options.vignette.tooltip": "Если эта функция включена, в поле зрения игрока будет отображаться эффект виньетки. Маловероятно, что это повлияет на частоту кадров, если только у вас не ограничена скорость заполнения.",
  "sodium.options.mipmap_levels.tooltip": "Определяет количество mip-карт, которые будут использоваться для текстур модели блока. Более высокие значения обеспечивают лучшую визуализацию блоков на расстоянии, но могут отрицательно сказаться на производительности при использовании большого количества анимированных текстур.",
  "sodium.options.use_block_face_culling.name": "Используйте отбраковку граней блоков",
  "sodium.options.use_block_face_culling.tooltip": "Если этот параметр включен, для рендеринга будут представлены только те стороны блоков, которые обращены к камере. Это позволяет исключить большое количество граней блоков на самом раннем этапе процесса рендеринга, экономя пропускную способность памяти и время работы графического процессора. У некоторых пакетов ресурсов могут быть проблемы с этой опцией, поэтому попробуйте отключить ее, если вы видите дыры в блоках.",
  "sodium.options.use_compact_vertex_format.name": "Используйте компактный формат вершин",
  "sodium.options.use_compact_vertex_format.tooltip": "Если этот параметр включен, для рендеринга фрагментов будет использоваться более компактный формат вершин. Это может значительно снизить использование графической памяти и требования к пропускной способности, особенно для интегрированных видеокарт, но может вызвать проблемы с некоторыми пакетами ресурсов из-за того, что это снижает точность атрибутов координат положения и текстуры. Отключение этого параметра не имеет никакого эффекта, если установлен Oculus.",
  "sodium.options.translucent_face_sorting.name": "Прозрачная сортировка граней",
  "sodium.options.translucent_face_sorting.tooltip": "Если этот параметр включен, то полупрозрачные эффекты на таких поверхностях, как стекло и вода, будут применены корректно.",
  "sodium.options.use_fog_occlusion.name": "Используйте туманную окклюзию",
  "sodium.options.use_fog_occlusion.tooltip": "Если этот параметр включен, фрагменты изображения, которые, как определено, полностью скрыты эффектами тумана, отображаться не будут, что способствует повышению производительности. Улучшение может быть более существенным при более интенсивных эффектах тумана (например, под водой), но в некоторых сценариях это может привести к нежелательным визуальным искажениям между небом и туманом.",
  "sodium.options.use_entity_culling.name": "Используйте отбраковку объектов",
  "sodium.options.use_entity_culling.tooltip": "Если этот параметр включен, объекты, которые не отображаются ни в одном из видимых фрагментов, будут пропущены во время рендеринга. Это может помочь повысить производительность за счет исключения рендеринга объектов, расположенных под землей или за стенами.",
  "sodium.options.animate_only_visible_textures.name": "Анимировать только видимые текстуры",
  "sodium.options.animate_only_visible_textures.tooltip": "Если этот параметр включен, будут обновляться только те анимированные текстуры, которые были определены как видимые. Это может значительно повысить частоту кадров на некоторых устройствах, особенно при использовании более мощных пакетов ресурсов. Если у вас возникли проблемы с тем, что некоторые текстуры не анимируются, попробуйте отключить эту опцию.",
  "sodium.options.cpu_render_ahead_limit.name": "Предел опережения рендеринга CPU",
  "sodium.options.cpu_render_ahead_limit.tooltip": "Указывает максимальное количество кадров, которое центральный процессор может ожидать от графического процессора для завершения рендеринга. Очень низкие или высокие значения могут привести к нестабильности частоты кадров.",
  "sodium.options.cpu_render_ahead_limit.value": "%s рамка(и)",
  "sodium.options.performance_impact_string": "Влияние на производительность: %s",
  "sodium.options.use_persistent_mapping.name": "Использовать постоянное сопоставление",
  "sodium.options.use_persistent_mapping.tooltip": "Если этот параметр включен, небольшой объем памяти будет постоянно отображаться в качестве промежуточного буфера для загрузки фрагментов, что помогает снизить нагрузку на процессор и нестабильность времени кадра при загрузке или обновлении фрагментов.\n\nТребуется OpenGL 4.4 или ARB_buffer_storage.",
  "sodium.options.chunk_update_threads.name": "Потоки обновления фрагментов",
  "sodium.options.chunk_update_threads.tooltip": "Указывает количество потоков, используемых для создания фрагментов. Использование большего количества потоков может ускорить загрузку фрагментов и скорость обновления, но может негативно повлиять на время создания кадров.",
  "sodium.options.always_defer_chunk_updates.name": "Всегда откладывайте обновления фрагментов",
  "sodium.options.always_defer_chunk_updates.tooltip": "Если эта функция включена, рендеринг никогда не будет дожидаться завершения обновлений фрагментов, даже если они важны. В некоторых сценариях это может значительно повысить частоту кадров, но в целом может привести к значительным задержкам отображения.",
  "sodium.options.use_no_error_context.name": "Не использовать контекст ошибки",
  "sodium.options.use_no_error_context.tooltip": "Если этот параметр включен, контекст OpenGL будет создан с отключенной проверкой ошибок. Это может немного повысить производительность, но также увеличивает риск того, что игра завершит работу с ошибкой, вместо того чтобы корректно обрабатывать ошибки OpenGL. Вам следует отключить эту опцию, если вы сталкиваетесь с внезапными необъяснимыми сбоями.",
  "sodium.options.buttons.undo": "Отменить",
  "sodium.options.buttons.apply": "Применить",
  "sodium.options.buttons.donate": "Поддержите Sodium!",
  "sodium.console.game_restart": "Чтобы применить одну или несколько настроек видео, необходимо перезапустить игру!",
  "sodium.console.broken_nvidia_driver": "Ваши графические драйверы NVIDIA устарели!\n  * Это приведет к серьезным проблемам с производительностью и сбоям при установке Embeddium.\n  * Пожалуйста, обновите ваши графические драйверы до последней версии (версия 536.23 или новее.)",
  "sodium.console.pojav_launcher": "PojavLauncher не поддерживается при использовании Embeddium.\n  * Вероятно, что вы столкнетесь с серьезными проблемами производительности, графическими ошибками и сбоями.\n  * Вы будете предоставлены сами себе, если решите продолжить -- мы не будем помогать вам с какими-либо ошибками или сбоями!",
  "sodium.console.core_shaders_error": "Следующие пакеты ресурсов несовместимы с Embeddium:",
  "sodium.console.core_shaders_warn": "Следующие пакеты ресурсов могут быть несовместимы с Embeddium:",
  "sodium.console.core_shaders_info": "Более подробную информацию смотрите в игровом журнале log."
}
